{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_1", "kernel_dim2": 5, "kernel_dim1": 5, "activation": "relu", "trainable": true, "dim_ordering": "th", "kernel_dim3": 5, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 25, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 12, 32, 120], "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "border_mode": "valid"}}, {"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_2", "kernel_dim2": 3, "kernel_dim1": 3, "activation": "relu", "trainable": true, "dim_ordering": "th", "kernel_dim3": 3, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 25, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "valid"}}, {"class_name": "MaxPooling3D", "config": {"name": "maxpooling3d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": 4200, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": 1024, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 4}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}